/*
• RODU-BOT | 11 زخرفة
• كل امر له خط مختلف
• من زخرفه1 إلى زخرفه11
*/

function handler(m, { text, conn, command }) {

if (!text) return conn.reply(m.chat, `❌ ادخل نص بعد الامر\nمثال:\n${command} hello world`, m)

// الزخارف
let z1 = { a:'𝙰',b:'𝙱',c:'𝙲',d:'𝙳',e:'𝙴',f:'𝙵',g:'𝙶',h:'𝙷',i:'𝙸',j:'𝙹',k:'𝙺',l:'𝙻',m:'𝙼',n:'𝙽',o:'𝙾',p:'𝙿',q:'𝚀',r:'𝚁',s:'𝚂',t:'𝚃',u:'𝚄',v:'𝚅',w:'𝚆',x:'𝚇',y:'𝚈',z:'𝚉'}
let z2 = { a:'𝔸',b:'𝔹',c:'ℂ',d:'𝔻',e:'𝔼',f:'𝔽',g:'𝔾',h:'ℍ',i:'𝕀',j:'𝕁',k:'𝕂',l:'𝕃',m:'𝕄',n:'ℕ',o:'𝕆',p:'ℙ',q:'ℚ',r:'ℝ',s:'𝕊',t:'𝕋',u:'𝕌',v:'𝕍',w:'𝕎',x:'𝕏',y:'𝕐',z:'ℤ'}
let z3 = { a:'𝐀',b:'𝐁',c:'𝐂',d:'𝐃',e:'𝐄',f:'𝐅',g:'𝐆',h:'𝐇',i:'𝐈',j:'𝐉',k:'𝐊',l:'𝐋',m:'𝐌',n:'𝐍',o:'𝐎',p:'𝐏',q:'𝐐',r:'𝐑',s:'𝐒',t:'𝐓',u:'𝐔',v:'𝐕',w:'𝐖',x:'𝐗',y:'𝐘',z:'𝐙'}
let z4 = { a:'𝑨',b:'𝑩',c:'𝑪',d:'𝑫',e:'𝑬',f:'𝑭',g:'𝑮',h:'𝑯',i:'𝑰',j:'𝑱',k:'𝑲',l:'𝑳',m:'𝑴',n:'𝑵',o:'𝑶',p:'𝑷',q:'𝑸',r:'𝑹',s:'𝑺',t:'𝑻',u:'𝑼',v:'𝑽',w:'𝑾',x:'𝑿',y:'𝒀',z:'𝒁'}
let z5 = { a:'𝐴',b:'𝐵',c:'𝐶',d:'𝐷',e:'𝐸',f:'𝐹',g:'𝐺',h:'𝐻',i:'𝐼',j:'𝐽',k:'𝐾',l:'𝐿',m:'𝑀',n:'𝑁',o:'𝑂',p:'𝑃',q:'𝑄',r:'𝑅',s:'𝑆',t:'𝑇',u:'𝑈',v:'𝑉',w:'𝑊',x:'𝑋',y:'𝑌',z:'𝑍'}
let z6 = { a:'𝒜',b:'ℬ',c:'𝒞',d:'𝒟',e:'ℰ',f:'ℱ',g:'𝒢',h:'ℋ',i:'ℐ',j:'𝒥',k:'𝒦',l:'ℒ',m:'ℳ',n:'𝒩',o:'𝒪',p:'𝒫',q:'𝒬',r:'ℛ',s:'𝒮',t:'𝒯',u:'𝒰',v:'𝒱',w:'𝒲',x:'𝒳',y:'𝒴',z:'𝒵'}
let z7 = { a:'𝗔',b:'𝗕',c:'𝗖',d:'𝗗',e:'𝗘',f:'𝗙',g:'𝗚',h:'𝗛',i:'𝗜',j:'𝗝',k:'𝗞',l:'𝗟',m:'𝗠',n:'𝗡',o:'𝗢',p:'𝗣',q:'𝗤',r:'𝗥',s:'𝗦',t:'𝗧',u:'𝗨',v:'𝗩',w:'𝗪',x:'𝗫',y:'𝗬',z:'𝗭'}
let z8 = { a:'ᗩ',b:'ᗷ',c:'ᑕ',d:'ᗪ',e:'ᗴ',f:'ᖴ',g:'ᘜ',h:'ᕼ',i:'I',j:'ᒍ',k:'K',l:'ᒪ',m:'ᗰ',n:'ᑎ',o:'O',p:'ᑭ',q:'ᑫ',r:'ᖇ',s:'Տ',t:'T',u:'ᑌ',v:'ᐯ',w:'ᗯ',x:'᙭',y:'Y',z:'ᘔ'}
let z9 = { a:'卂',b:'乃',c:'匚',d:'刀',e:'乇',f:'下',g:'厶',h:'卄',i:'工',j:'丁',k:'长',l:'乚',m:'从',n:'𠘨',o:'口',p:'尸',q:'㔿',r:'尺',s:'丂',t:'丅',u:'凵',v:'リ',w:'山',x:'乂',y:'丫',z:'乙'}
let z10 = { a:'𝘼',b:'𝘽',c:'𝘾',d:'𝘿',e:'𝙀',f:'𝙁',g:'𝙂',h:'𝙃',i:'𝙄',j:'𝙅',k:'𝙆',l:'𝙇',m:'𝙈',n:'𝙉',o:'𝙊',p:'𝙋',q:'𝙌',r:'𝙍',s:'𝙎',t:'𝙏',u:'𝙐',v:'𝙑',w:'𝙒',x:'𝙓',y:'𝙔',z:'𝙕'}
let z11= { a:'🇦',b:'🇧',c:'🇨',d:'🇩',e:'🇪',f:'🇫',g:'🇬',h:'🇭',i:'🇮',j:'🇯',k:'🇰',l:'🇱',m:'🇲',n:'🇳',o:'🇴',p:'🇵',q:'🇶',r:'🇷',s:'🇸',t:'🇹',u:'🇺',v:'🇻',w:'🇼',x:'🇽',y:'🇾',z:'🇿'}

// اختيار جدول حسب رقم الأمر
let map = eval('z' + command.replace('زخرفه',''))

let out = text.replace(/[a-z]/gi, v => map[v.toLowerCase()] || v)

conn.reply(m.chat, out, m)

}

handler.command = ['زخرفه1','زخرفه2','زخرفه3','زخرفه4','زخرفه5','زخرفه6','زخرفه7','زخرفه8','زخرفه9','زخرفه10','زخرفه11']
export default handler